# Напишите программу, которая по заданному номеру четверти, показывает диапазон 
# возможных координат точек в этой четверти (x и y).

from random import randint

num = int(input('Ведите номер четверти: '))
if num == 1:
    x = randint(1, 1000)
    y = randint(1, 1000)
    print('Возможные координаты точки (x,y):', x, ',', y)
elif num == 2:
    x = randint(-1000, 1)
    y = randint(1, 10000)
    print('Возможные координаты точки (x,y):', x, ',', y)
elif num == 3:
    x = randint(-1000, 1)
    y = randint(-1000, 1)
    print('Возможные координаты точки (x,y):', x, ',', y)
elif num == 4:
    x = randint(1, 1000)
    y = randint(-1000, 1)
    print('Возможные координаты точки (x,y):', x, ',', y)
else:
    print('Неверный номер четверти.')